<a href="https://colab.research.google.com/github/arora123/Statistics-for-Data-Science-using-Python/blob/main/OTS_Session1_Data_Cleaning_1_ipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning process includes

 - Data Validation
 - Missing values Identification & Treatment
 - Extreme Value Identification & Treatment
 - String operations
 - Data & Time Operations

**In this course, we are focusing in missing value treatment**

#Getting Data

In [ ]:
# import data set
import pandas as pd
# bank = pd.read_csv('/content/drive/My Drive/OTS_Data/bank.csv') #from google drive

bank = pd.read_csv('https://raw.githubusercontent.com/arora123/Data/master/bank.csv') #from github
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1      NaN      2     NaN      NaN         NaN
2      NaN      3     NaN      NaN         NaN
3      NaN      4      Q2   6000.0      4000.0
4      NaN      5     NaN      NaN         NaN
5      NaN      6     NaN      NaN         NaN
6      NaN      7      Q3      NaN         NaN
7      NaN      8     NaN   3000.0      3000.0
8      NaN      9     NaN   2000.0      1000.0
9      NaN     10      Q4      NaN         NaN
10     NaN     11     NaN      NaN         NaN
11     NaN     12     NaN   1000.0      1000.0

In [ ]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1 non-null      float64
 1   Month       12 non-null     int64
 2   Quarter     4 non-null      object
 3   Balance     5 non-null      float64
 4   Withdrawal  4 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 608.0+ bytes

In [ ]:
#Let's have a look at shape of the data frame & column names
print(len(bank)) 
print(bank.shape)
print(bank.dtypes)
# Get column names
print(bank.columns)

12
(12, 5)
Year          float64
Month           int64
Quarter        object
Balance       float64
Withdrawal    float64
dtype: object
Index(['Year', 'Month', 'Quarter', 'Balance', 'Withdrawal'], dtype='object')

bank data contains many missing values in all columns except 'Month'

#let's check for null values

- For entire data frame
- Column wise missing values
- Row wise missing values

In [ ]:
# For entire data frame
print(bank.isnull()) #True & False

     Year  Month  Quarter  Balance  Withdrawal
0   False  False    False    False        True
1    True  False     True     True        True
2    True  False     True     True        True
3    True  False    False    False       False
4    True  False     True     True        True
5    True  False     True     True        True
6    True  False    False     True        True
7    True  False     True    False       False
8    True  False     True    False       False
9    True  False    False     True        True
10   True  False     True     True        True
11   True  False     True    False       False

In [ ]:
bank.isnull().sum()

bank.isnull().sum().sum()

34

In [ ]:
# Column-wise null values

print(bank.isnull().sum()) # total number of missing values in each column
print(bank.isnull().sum().sum(), '\n') # total number of missing values in entire data frame

print(bank.notnull().sum())  # non null value counts  in each column
print(bank.notnull().sum().sum(), '\n') # non null value counts  in entire data frame

bank.size # Total number of data points in 'bank' data

Year          11
Month          0
Quarter        8
Balance        7
Withdrawal     8
dtype: int64
34

Year           1
Month         12
Quarter        4
Balance        5
Withdrawal     4
dtype: int64
26

60

In [ ]:
# Check column-wise missing values in descending order
bank.isnull().sum().sort_values(ascending=False)

In [ ]:
# Check if missing values in one column
print(bank['Year'].isnull())

0     False
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: Year, dtype: bool

In [ ]:
print('Is there any missing value in year column? ', bank['Year'].isnull(), '\n')

print('How many missing in year column? ', bank['Year'].isnull().sum())

Is there any missing value in year column?  0     False
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: Year, dtype: bool

How many missing in year column?  11

In [ ]:
# Row-wise missing values

print(bank.isnull().sum(axis=1)) # axis = 1 for rowwise sum, default is axis=0

bank.isnull().sum(axis=1).sum() # Total number of missing values in entire data frame

# Drop Missing values
1. drop column
2. drop rows

If you want to simply exclude the missing values, then use the dropna function along with the axis argument. 

By default, axis=0, i.e., along row, which means that if any value within a row is NA then the whole row is excluded.

other useful arguments: 
how: 'any' [default] or 'all'

inplace: False [default] or True

thresh

In [ ]:
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1      NaN      2     NaN      NaN         NaN
2      NaN      3     NaN      NaN         NaN
3      NaN      4      Q2   6000.0      4000.0
4      NaN      5     NaN      NaN         NaN
5      NaN      6     NaN      NaN         NaN
6      NaN      7      Q3      NaN         NaN
7      NaN      8     NaN   3000.0      3000.0
8      NaN      9     NaN   2000.0      1000.0
9      NaN     10      Q4      NaN         NaN
10     NaN     11     NaN      NaN         NaN
11     NaN     12     NaN   1000.0      1000.0

## To remove rows with  'any' missing values

In [ ]:
bank.dropna()
#By default, axis=0, i.e., along row, 
# which means that if any value within a row is NA then the whole row is excluded.
# Note inplace argument

Empty DataFrame
Columns: [Year, Month, Quarter, Balance, Withdrawal]
Index: []

## To remove columns with  'any' missing values

In [ ]:
bank.dropna(axis=1)
# By setting, axis=1, i.e., along column, 
# which means that if any value within a column is NA then the whole column is excluded.

    Month
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10
10     11
11     12

## To remove rows/columns with 'all' missing values

In [ ]:
bank.dropna(axis=0, how='all')
# bank.dropna(axis=1, how='all')

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1      NaN      2     NaN      NaN         NaN
2      NaN      3     NaN      NaN         NaN
3      NaN      4      Q2   6000.0      4000.0
4      NaN      5     NaN      NaN         NaN
5      NaN      6     NaN      NaN         NaN
6      NaN      7      Q3      NaN         NaN
7      NaN      8     NaN   3000.0      3000.0
8      NaN      9     NaN   2000.0      1000.0
9      NaN     10      Q4      NaN         NaN
10     NaN     11     NaN      NaN         NaN
11     NaN     12     NaN   1000.0      1000.0

# Filling missing values

1. For Year, Quarter, Balance; logically we need to fill value from previous record

fillna(method='ffill') or  fillna(method='pad') will do the job


2. For Withdrawl column, we belive missing value represent no withdrawl.

so we can replace those by '0'

fillna(0) will do the job

In [ ]:
bank[['Year', 'Quarter', 'Balance']]= bank[['Year', 'Quarter', 'Balance']].fillna(method='ffill')
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         NaN
1   2000.0      2      Q1  10000.0         NaN
2   2000.0      3      Q1  10000.0         NaN
3   2000.0      4      Q2   6000.0      4000.0
4   2000.0      5      Q2   6000.0         NaN
5   2000.0      6      Q2   6000.0         NaN
6   2000.0      7      Q3   6000.0         NaN
7   2000.0      8      Q3   3000.0      3000.0
8   2000.0      9      Q3   2000.0      1000.0
9   2000.0     10      Q4   2000.0         NaN
10  2000.0     11      Q4   2000.0         NaN
11  2000.0     12      Q4   1000.0      1000.0

In [ ]:
# 2. Replacing missing values in Withdrawl column by '0'

bank[['Withdrawal']]= bank[['Withdrawal']].fillna(0)
bank

      Year  Month Quarter  Balance  Withdrawal
0   2000.0      1      Q1  10000.0         0.0
1   2000.0      2      Q1  10000.0         0.0
2   2000.0      3      Q1  10000.0         0.0
3   2000.0      4      Q2   6000.0      4000.0
4   2000.0      5      Q2   6000.0         0.0
5   2000.0      6      Q2   6000.0         0.0
6   2000.0      7      Q3   6000.0         0.0
7   2000.0      8      Q3   3000.0      3000.0
8   2000.0      9      Q3   2000.0      1000.0
9   2000.0     10      Q4   2000.0         0.0
10  2000.0     11      Q4   2000.0         0.0
11  2000.0     12      Q4   1000.0      1000.0

In [ ]:
bank.isnull().sum()

Year          0
Month         0
Quarter       0
Balance       0
Withdrawal    0
dtype: int64

#If missing values in the data frame are not default np.nan

In [ ]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/arora123/Data/master/property%20data.csv")
print(df.columns)
df

Index(['PID', 'ST_NUM', 'ST_NAME', 'OWN_OCCUPIED', 'NUM_BEDROOMS', 'NUM_BATH',
       'SQ_FT'],
      dtype='object')

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH    SQ_FT
0  100001000.0   104.0    berkeley            Y            3        1     1000
1  100002000.0   197.0    berkeley            N            3      1.5       --
2  100003000.0     NaN    berkeley            N          NaN        1      850
3  100004000.0   201.0  California           12            1      NaN      700
4          NaN   203.0        Lowa            Y            3        2     1600
5  100006000.0   207.0        Lowa            Y          NaN        1      800
6  100007000.0     NaN  New Jersey          NaN            2   HURLEY      950
7  100008000.0   213.0  New Jersey            Y            1        2  unknown
8  100009000.0   215.0  Washington            Y           na        2     1800

## To check for missing values

In [ ]:
# Do we have non-null values?
df.isnull()
# How many non-null values are there in each column?
df.isnull().sum()
# Does not actually show all invalid or missing values

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           0
dtype: int64

## To see non-null values in a particular column

In [ ]:
df.NUM_BEDROOMS.isnull() 
# df.NUM_BEDROOMS.isnull()
# df.NUM_BEDROOMS.isnull()

## Providing additional strings to recognize as NaN/NA values

If dict passed, specific per-column NA values.
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [ ]:
missing_values = ["na", "--","12", "HURLEY", 'unknown']
df1 = pd.read_csv("https://raw.githubusercontent.com/arora123/Data/master/property%20data.csv", 
                  na_values = missing_values)
df1

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0    berkeley            Y           3.0       1.0  1000.0
1  100002000.0   197.0    berkeley            N           3.0       1.5     NaN
2  100003000.0     NaN    berkeley            N           NaN       1.0   850.0
3  100004000.0   201.0  California          NaN           1.0       NaN   700.0
4          NaN   203.0        Lowa            Y           3.0       2.0  1600.0
5  100006000.0   207.0        Lowa            Y           NaN       1.0   800.0
6  100007000.0     NaN  New Jersey          NaN           2.0       NaN   950.0
7  100008000.0   213.0  New Jersey            Y           1.0       2.0     NaN
8  100009000.0   215.0  Washington            Y           NaN       2.0  1800.0

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  7 non-null      object
 4   NUM_BEDROOMS  6 non-null      float64
 5   NUM_BATH      7 non-null      float64
 6   SQ_FT         7 non-null      float64
dtypes: float64(5), object(2)
memory usage: 632.0+ bytes

##Replacing missing values with a number

If we have got some logic to fill missing values in ST_NUM variable

In [ ]:
# Replacing all street numbers by 125
# df1['ST_NUM'].fillna(125)

In [ ]:
df1.loc[(df['ST_NAME'] == 'berkeley') & df1['ST_NUM'].isnull(), 'ST_NUM']

2   NaN
Name: ST_NUM, dtype: float64

## Replacing missing values with numbers based on some condition

In [ ]:
# Replacing street numbers of 'berkeley' by 125 and for 'New Jersey' by 214

df1.loc[(df['ST_NAME'] == 'berkeley') & df1['ST_NUM'].isnull(), 'ST_NUM'] = 125

df1.loc[(df['ST_NAME'] == 'New Jersey') & df1['ST_NUM'].isnull(), 'ST_NUM'] = 214

In [ ]:
df1['ST_NUM']

# Notice these changes are happening in place

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    214.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

## Reaplcing missing values with mean in 'NUM_BEDROOMS' columns

In [ ]:
x = df1['NUM_BEDROOMS'].mean()
df1['NUM_BEDROOMS_mean_impute'] = df1['NUM_BEDROOMS'].fillna(x)


# df1['NUM_BEDROOMS'] = df1['NUM_BEDROOMS'].fillna(df1['NUM_BEDROOMS'].mean())

df1 # does not make sense to have number of bedrooms as 2.166667
# we may need to round up

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  NUM_BEDROOMS_mean_impute
0  100001000.0   104.0    berkeley  ...      1.0  1000.0                  3.000000
1  100002000.0   197.0    berkeley  ...      1.5     NaN                  3.000000
2  100003000.0   125.0    berkeley  ...      1.0   850.0                  2.166667
3  100004000.0   201.0  California  ...      NaN   700.0                  1.000000
4          NaN   203.0        Lowa  ...      2.0  1600.0                  3.000000
5  100006000.0   207.0        Lowa  ...      1.0   800.0                  2.166667
6  100007000.0   214.0  New Jersey  ...      NaN   950.0                  2.000000
7  100008000.0   213.0  New Jersey  ...      2.0     NaN                  1.000000
8  100009000.0   215.0  Washington  ...      2.0  1800.0                  2.166667

[9 rows x 8 columns]

## Reaplcing missing values by forward fill method

In [ ]:
# Replacing missing values by previous values
df1['SQ_FT'].fillna(method='ffill', inplace=True)
df1

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  NUM_BEDROOMS_mean_impute
0  100001000.0   104.0    berkeley  ...      1.0  1000.0                  3.000000
1  100002000.0   197.0    berkeley  ...      1.5  1000.0                  3.000000
2  100003000.0   125.0    berkeley  ...      1.0   850.0                  2.166667
3  100004000.0   201.0  California  ...      NaN   700.0                  1.000000
4          NaN   203.0        Lowa  ...      2.0  1600.0                  3.000000
5  100006000.0   207.0        Lowa  ...      1.0   800.0                  2.166667
6  100007000.0   214.0  New Jersey  ...      NaN   950.0                  2.000000
7  100008000.0   213.0  New Jersey  ...      2.0   950.0                  1.000000
8  100009000.0   215.0  Washington  ...      2.0  1800.0                  2.166667

[9 rows x 8 columns]

## Replacing missing values by backward fill method

In [ ]:
df1['NUM_BATH'].fillna(method='bfill', inplace=True)
df1['OWN_OCCUPIED'].fillna(method='backfill', inplace=True)
df1

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT  NUM_BEDROOMS_mean_impute
0  100001000.0   104.0    berkeley  ...      1.0  1000.0                  3.000000
1  100002000.0   197.0    berkeley  ...      1.5  1000.0                  3.000000
2  100003000.0   125.0    berkeley  ...      1.0   850.0                  2.166667
3  100004000.0   201.0  California  ...      2.0   700.0                  1.000000
4          NaN   203.0        Lowa  ...      2.0  1600.0                  3.000000
5  100006000.0   207.0        Lowa  ...      1.0   800.0                  2.166667
6  100007000.0   214.0  New Jersey  ...      2.0   950.0                  2.000000
7  100008000.0   213.0  New Jersey  ...      2.0   950.0                  1.000000
8  100009000.0   215.0  Washington  ...      2.0  1800.0                  2.166667

[9 rows x 8 columns]

##Replacing missing values in multiple columns

In [ ]:
#Replace all NaN elements in column ‘A’, ‘B’, ‘C’, and ‘D’, with 0, 1, 2, and 3 respectively.
values = {'ST_NUM': '125', 'NUM_BEDROOMS': 0, 'NUM_BATH': 1, 'OWN_OCCUPIED': 'Y'}
df.fillna(value=values, inplace=True)
print('non-null values in each column are: ', '\n', df.isnull().sum())
df

non-null values in each column are:
 PID             1
ST_NUM          0
ST_NAME         0
OWN_OCCUPIED    0
NUM_BEDROOMS    0
NUM_BATH        0
SQ_FT           0
dtype: int64

           PID ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH    SQ_FT
0  100001000.0    104    berkeley            Y            3        1     1000
1  100002000.0    197    berkeley            N            3      1.5       --
2  100003000.0    125    berkeley            N            0        1      850
3  100004000.0    201  California           12            1        1      700
4          NaN    203        Lowa            Y            3        2     1600
5  100006000.0    207        Lowa            Y            0        1      800
6  100007000.0    125  New Jersey            Y            2   HURLEY      950
7  100008000.0    213  New Jersey            Y            1        2  unknown
8  100009000.0    215  Washington            Y           na        2     1800